/*************************************************************************************************************
										-- 定义数据类型-头文件 --
文件名称：Type.h
代码整理：闫春林
整理日期：2017年11月24日
免责声明：该程序仅用于学习与交流
调用说明：引入本文件后，直接使用U8、U16、U32分别定义无符号的8位、16位、32位数据类型即可，S8、S16、S32为有符号的
*************************************************************************************************************/

#ifndef	_Type_H_
#define	_Type_H_


typedef unsigned char U8;
typedef unsigned int U16;
typedef unsigned long U32;

typedef signed char S8;
typedef signed int S16;
typedef signed long S32;

#endif